% ѕолучение матрицы - составного множител€ €кобиана

function M = B(a, b, C, S, R, Ri)

    B1 = [b^2*R(1)*C - a^2*R(2)*S
        b^2*(Ri(2)-R(2))*C + a^2*(Ri(1)-R(1))*S];
    
    B2 = [b^2*R(1)*S + a^2*R(2)*C
        b^2*(Ri(2)-R(2))*S - a^2*(Ri(1)-R(1))*C];
    
    B3 = [a*(b^2 - R(2)^2)
        2*a*R(2)*(Ri(1) - R(1))];
    
    B4 = [b*(a^2 - R(1)^2)
        -2*b*R(1)*(Ri(2) - R(2))];
    
    B5 = [(a^2 - b^2)*R(1)*R(2)
        (a^2 - b^2)*(R(1)^2 - R(2)^2 - R(1)*Ri(1) + R(2)*Ri(2))];
    
    M = [B1 B2 B3 B4 B5];

end