% –ешаем кубическое уравнение вида ax^3 + bx^2 + cx + d = 0

function [x1, x2, x3] = solve3(a, b, c, d)

% ѕриведем к виду y^3 + py + q = 0
% «амена: x = y - b/3a
p = c/a - b^2/(3*a^2);
q = 2*b^3/(27*a^3) - b*c/(3*a^2) + d/a;

Q = (p/3)^3 + (q/2)^2;
% Q > 0 - один вещественный корень и два сопр€женных комплексных корн€
% Q = 0 - один однократный вещественный корень и один двукратный, или,
%         если p = q = 0, то один трехкратный вещественный корень
% Q < 0 - три вещественный корн€

al = 0;
be = 0;
if Q >= 0
    al = nthroot(-q/2 + sqrt(Q), 3);
    be = nthroot(-q/2 - sqrt(Q), 3);
else
    al = -q/2 + sqrt(Q);
    al = al^(1/3);
    be = -q/2 - sqrt(Q);
    be = be^(1/3);
end

y1 = al + be;
y2 = -(al+be)/2 + i*(al-be)*sqrt(3)/2;
y3 = -(al+be)/2 - i*(al-be)*sqrt(3)/2;


x1 = y1 - b/(3*a);
x2 = y2 - b/(3*a);
x3 = y3 - b/(3*a);

% disp(' убическое уравнение');
% e1=a*x1*x1*x1+b*x1*x1+c*x1+d;
% %if(abs(a1)>1e-10) a1
% e2=a*x2^3+b*x2^2+c*x2+d;
% %if(abs(a1)>1e-10) a1
% e3=a*x3^3+b*x3^2+c*x3+d;
%if(abs(a1)>1e-10) a1

end
